[
  {
    "id": 8,
    "title": "Pintech | In Process..",
    "description": "Static site for a robotic automation company. Pintech specializes in cutting-edge robotic automation systems, revolutionizing industries with advanced technology and efficient solutions.",
    "image": "https://newportv2.s3.us-east-2.amazonaws.com/Cover-11.jpg",
    "link": "https://pintechproject-theta.vercel.app/",
    "github": "https://github.com/Oscarl214/pintechproject",
    "technologies": "NextUI, Vercel, FramerMotion, S3, TypeScript, TailWind"
  },
  {
    "id": 7,
    "title": "Runners Unidos",
    "description": "Runners Unidos is a full-stack web application I built to serve as an information hub for a local running club in Dallas, Texas. The site helps keep our running community connected by providing easy access to schedules, events, and more.",
    "image": "https://newportv2.s3.us-east-2.amazonaws.com/runners.jpg",
    "link": "https://runnersunidos.vercel.app",
    "github": "https://github.com/Oscarl214/runnersunidos",
    "technologies": "NextUI, Vercel, FramerMotion, AWS: RDS & S3, TypeScript, TailWind"
  },
  {
    "id": 6,
    "title": "VidaBevidasProject",
    "description": "VidaBebidas Project is a comprehensive, full-stack website designed to serve as a booking platform for a mobile bartender. The site features a professional video showcasing the client's expertise, along with written reviews from previous clients. Users can explore a detailed packages page to learn about the services offered and access a booking page to submit a booking form. The site is paired with Prisma + MongoDB + NodeMailer to offer a fluid method of creating users and bookings, while also providing a email template that is delivered to customers upon booking.",
    "image": "https://newportv2.s3.us-east-2.amazonaws.com/desktopvida.png",
    "link": "https://www.vidabevidasproject.me/",
    "github": "https://github.com/Oscarl214/VidaBebidasProject-",
    "technologies": "NextUI, Vercel, DaisyUI, FramerMotion, AWS, TypeScript, TailWind, Prisma, MongoDB, NodeMailer"
  },
  {
    "id": 5,
    "title": "Leal Directory",
    "description": "The Vehicle Maintenance Tracker is a private, full-stack application exclusively designed for my family to track the maintenance history of our vehicles. It provides a convenient maintenance guide to help users identify tasks and allows them to log the type of maintenance along with the date it was completed. Built with Next.js and secured with NextAuth for authentication, this application offers a secure and user-friendly experience. By keeping the site exclusive, it ensures that our family can easily update and monitor vehicle maintenance, solving the issue of forgetting service dates and keeping our cars in top shape.",
    "image": "https://newportv2.s3.us-east-2.amazonaws.com/CaRdIRECT.gif",
    "link": "https://lealvechiledirectory.vercel.app/",
    "github": "https://github.com/Oscarl214/Lealvechiledirectory",
    "technologies": "NextUI, Vercel, DaisyUI, FramerMotion, AWS, TypeScript, TailWind, Prisma, MongoDB, NextAuth"
  },
  {
    "id": 4,
    "title": "AR WEBPAGE",
    "description": "Designed a mock e-commerce web page utilizing the power of augmented reality (AR) to showcase three 3D modals of different products for a B2C Company of choice.",
    "image": "https://portfolioprojectsol.s3.us-east-2.amazonaws.com/WebARProejct.png",
    "link": "https://yywb1u.csb.app/",
    "github": "https://github.com/Oscarl214/WebAR-Project",
    "technologies": "HTML, CSS, JavaScript, SandBox, Modal Viwer Component npm package"
  },
  {
    "id": 3,
    "title": "Chrsitmas List V2",
    "description": "Leal's Christmas Wishes is a private, full-stack application built exclusively for my family to help organize and share our Christmas lists for the upcoming year. This version is a major upgrade from the original, where I previously used GraphQL. Now, I've leveraged the power of Next.js, Prisma, and NextAuth to create a more versatile and user-friendly experience for my family.",
    "image": "https://christmaslist21.s3.us-east-2.amazonaws.com/WishChrist.gif",
    "link": "https://christmaslist-v2.vercel.app",
    "github": "https://github.com/Oscarl214/christmaslist-v2",
    "technologies": "NextUI, Vercel, DaisyUI, FramerMotion, AWS, TypeScript, TailWind, Prisma, MongoDB, NextAuth"
  },
  {
    "id": 2,
    "title": "Social Network API",
    "description": "A restful API for a social network application where users can share thoughts,react to friends thoughts, and create a friends list. This challenged me to grasp a nonSQL workflow when working on the backend.Utilized Insomia for testing all routes.",
    "image": "https://portfolioprojectsol.s3.us-east-2.amazonaws.com/SocialMediaAPI.png",
    "link": "",
    "github": "https://github.com/Oscarl214/Social-Media-API",
    "technologies": "NodeJs, MongoDb, Mongoose, Insomia"
  },
  {
    "id": 1,
    "title": "Ecommerce Store",
    "description": "Created a back end for a e-commerce store. This project challenged me to grasp a MySQL workflow. Utilized postman to test al routes.",
    "image": "https://portfolioprojectsol.s3.us-east-2.amazonaws.com/EcommerceBackend.png",
    "link": "",
    "github": "https://github.com/Oscarl214/Ecommerce_BackEnd",
    "technologies": "Nodejs, Express, MySql, Sequelize"
  }
]
